<template lang="pug">
.flex.my-6.flex-col.sm__flex-row
  .pr-4(class="basis-1/4")
    h2.ra__title Профессиональные цели
  div(class="basis-3/4")
    ul.mt-2.list-disc.list-inside
      li Постоянное стремление к получению новых знаний в различных областях, чтобы улучшить себя лично и профессионально.
      li Стремление привносить новые технологии и делать процесс работы автоматизированным
hr.ra__hr

.ra__block
  .pr-4(class="basis-1/4")
    h2.ra__title Навыки
  .flex.gap-4.sm__gap-8.flex-col.sm__flex-row.mt-2(class="basis-3/4")
    span(class="basis-1/3")
      h3.text-xl.mb-2 Управление
      p Делать работу команды прозрачной, приятной и продуктивной
    span(class="basis-1/3")
      h3.text-xl.mb-2 Програмирование
      p Разработка веб-систем с использование современных технологий для решение бизнес-задач
    span(class="basis-1/3")
      h3.text-xl.mb-2 Автоматизация
      p Внедрение практик DevOps в команды разработки
hr.ra__hr

.ra__block
  .pr-4(class="basis-1/4")
    h2.ra__title Софт навыки
  div(class="basis-3/4")
    ul.mt-2.list-disc.list-inside
      li Управление проектами, понимаю как спокойно вести 10+ проектов
      li Управление командой разработчиков, понимаю как выстроить процесс эффективной работы над проектами
      li Навыки делового общения с коллегами, клиентами и руководителями
      li Навыки работы в команде, способность синхронизировать свою деятельность с другими членами команды, постановка задач и отслеживание
      li Решение проблем, не ищу виноватых, а ищу решение и делают так чтобы проблема не повторялась
hr.ra__hr

.ra__block
  .pr-4(class="basis-1/4")
    h2.ra__title Технические навыки
  .flex.flex-col.mt-2.gap-4(class="basis-3/4")
    span
      h3.text-xl.mb-2 Програмирование
      .flex.gap-2
        span.ra__tag PHP
        span.ra__tag MySQL
        span.ra__tag JS
        span.ra__tag Python
        span.ra__tag ООП
    span
      h3.text-xl.mb-2 Фрэймворки
      .flex.gap-2
        span.ra__tag Laravel
        span.ra__tag Vue
    span
      h3.text-xl.mb-2 Операционные системы
      .flex.gap-2
        span.ra__tag Linux
        span.ra__tag Ubuntu
        span.ra__tag CentOS
    span
      h3.text-xl.mb-2 DevOps
      .flex.gap-2
        span.ra__tag Docker
        span.ra__tag Jenkins
        span.ra__tag GitLab CI/CD
        span.ra__tag GitHub Actions
    span
      h3.text-xl.mb-2 Управление
      .flex.gap-2
        span.ra__tag YouTrack
        span.ra__tag JIRA
        span.ra__tag Trello
    span
      h3.text-xl.mb-2 Прочее
      .flex.gap-2
        span.ra__tag 10 пальцевая слепая печать

hr.ra__hr

.ra__block
  .pr-4(class="basis-1/4")
    h2.ra__title Опыт
  .flex.flex-col.mt-2.gap-4(class="basis-3/4")
    span
      h3.text-xl.mb-2.font-bold Технический менеджер проектов
      p
        | 42 solutions (
        a(href="https://42sol.ru") https://42sol.ru
        | ) Август 2020 - Настоящее время
      p.mt-4.font-bold Обязанности
      ul.mt-2.list-disc.list-inside
        li Управление разработкой от ТЗ до внедрения в эксплуатацию сайтов и сервисов
        li Управление разработкой нового функционала и техническая поддержка для 10+ проектов
        li Управление работой 2-х групп разработки по Agile/Scrum, фасилитация внутренних встречи, информационная и методологическая поддержка команды
        li Разработка и оценка технических заданий для разработчиков на основе идей клиентов и историй product-менеджеров
      p.mt-4.font-bold Достижения
      ul.mt-2.list-disc.list-inside
        li Внедрил Scrum в проектную команду, количество закрываемых задач в увеличилось в ~5 раз от среднего показателя за последние 6 месяцев
        li Участвовал во внедрении автоматической интеграции, развертывании и доставки (CI/CD) для проектов компании, отучил разработчиков ходить на сервера по SSH и вносить изменения в ручную, пропали дефекты при переносе изменений из локальной среды на продакшен, также повысил удобство работы внешних подрядчиков клиентов, количество пулл-реквестов увеличилось в 10 раз, скорость попадания изменений от локальной среды в продакшен сократилось до 5 минут
        li Выстроил процессы разработки команд, увеличив тем самым общую выработку отдела на 21% в первый месяц, и на 80% через 3 месяца

    hr.ra__hr
    span.mt-2
      h3.text-xl.mb-2.font-bold Менеджер по продажам
      p
        | Motoland (
        a(href="https://motoland-shop.ru") https://motoland-shop.ru
        | ) Февраль 2019 — Май 2020 (1 год и 4 месяца)
      p.mt-4.font-bold Обязанности
      ul.mt-2.list-disc.list-inside
        li Общение с клиентами, продажи
        li Обучение новых продавцов
        li Написание технических заданий программистам по доработке сайта и контроль выполнения в рамках сроков и бюджета
        li Оптимизация процессов продажи
      p.mt-4.font-bold Достижения
      ul.mt-2.list-disc.list-inside
        li Внедрил скрам в проектную команду, количество закрываемых задач в увеличилось в ~5 раз от среднего показателя за последние 6 месяцев
        li Участвовал во внедрении автоматической интеграции, развертывании и доставки (CI/CD) для проектов компании, отучил разработчиков ходить на сервера по SSH и вносить изменения в ручную, пропали дефекты при переносе изменений из локальной среды на продакшен, также повысил удобство работы внешних подрядчиков клиентов, количество пулл-реквестов увеличилось в 10 раз, скорость попадания изменений от локальной среды в продакшен сократилось до 5 минут
        li Выстроил процессы разработки команд, увеличив тем самым общую выработку отдела на 21% в первый месяц, и на 80% через 3 месяца

    hr.ra__hr
    span.mt-2
      h3.text-xl.mb-2.font-bold Интернет-маркетолог
      p
        | Pitbikeclub (
        a(href="https://pitbikeclub.ru") https://pitbikeclub.ru
        | ) Февраль 2018 — Ноябрь 2018 (10 месяцев)
      p.mt-4.font-bold Обязанности
      ul.mt-2.list-disc.list-inside
        li Поиск идей по улучшение сервиса магазина
        li Подключение, ведение и оптимизация рекламных каналов
        li Создание авторских статей
      p.mt-4.font-bold Достижения
      ul.mt-2.list-disc.list-inside
        li Подключил и настроил рекламные каналы с окупаемостью в 11 раз
        li Ввел стандарты оформления карточек товаров и выстроил для него процесс обновления информации в текущих карточках, а также для ново поступивших товаров что привело к снижению нагрузки на отдел продаж и увеличило конверсию магазина на 40%

hr.ra__hr

.ra__block
  .pr-4(class="basis-1/4")
    h2.ra__title Учеба
  .flex.flex-col.mt-2.gap-4(class="basis-3/4")
    span
      h3.text-xl.mb-2.font-bold ЭМК КГТА им. Дегтярева
      p Электротехнические устройства, 2010 - 2014
    hr.ra__hr
    span.mt-2
      h3.text-xl.mb-2.font-bold Веб-разработчик в gb.ru
      p Август 2021 — Сентябрь 2022 (1 год и 1 месяц)
      p.mt-4.font-bold
        | Дипломная работа Site Check (
        a(href="https://s-check.ru") https://s-check.ru
        | )
      p Сервис мониторинга работы сайтов, настройте мониторинг и получайте отчеты о доступности вашего сайта на почту или в телеграмм
      p.mt-4.font-bold Что делал в проекте
      ul.mt-2.list-disc.list-inside
        li Придумал идею и составил техническое задание
        li Нашел команду
        li Разработал блок-схему дизайна сервиса
        li Применены принципы Scrum с итерациями в 1 неделю
        li Разбил техническое задание на эпики, истории, задачи
        li Развернул проект с необходимыми технологиями
        li Настроил непрерывное развертывание и доставку на хостинг
        li Написал основную бизнес-логику сервиса
        li Написал часть фронта
      p.mt-4.font-bold Примененные технологии
      .flex.gap-2.pt-2.flex-wrap
        span.ra__tag Laravel
        span.ra__tag MySQL
        span.ra__tag Breeze
        span.ra__tag Vue 3
        span.ra__tag Pinia
        span.ra__tag Vite
        span.ra__tag Inertia
        span.ra__tag Docker
        span.ra__tag Iview
        span.ra__tag MySQL
        span.ra__tag Iview
        span.ra__tag Tailwind
        span.ra__tag GitHub Actions
</template>

<script setup></script>
